[
  {
    "title": "VINO: A Unified Visual Generator with Interleaved OmniModal Context",
    "authors": [
      "Junyi Chen",
      "Tong He",
      "Zhoujie Fu",
      "Pengfei Wan",
      "Kun Gai",
      "Weicai Ye"
    ],
    "arxiv_id": "2601.02358v1",
    "url": "http://arxiv.org/abs/2601.02358v1",
    "summary": "We present VINO, a unified visual generator that performs image and video generation and editing within a single framework. Instead of relying on task-specific models or independent modules for each modality, VINO uses a shared diffusion backbone that conditions on text, images and videos, enabling a broad range of visual creation and editing tasks under one model. Specifically, VINO couples a vision-language model (VLM) with a Multimodal Diffusion Transformer (MMDiT), where multimodal inputs are encoded as interleaved conditioning tokens, and then used to guide the diffusion process. This design supports multi-reference grounding, long-form instruction following, and coherent identity preservation across static and dynamic content, while avoiding modality-specific architectural components. To train such a unified system, we introduce a multi-stage training pipeline that progressively expands a video generation base model into a unified, multi-task generator capable of both image and video input and output. Across diverse generation and editing benchmarks, VINO demonstrates strong visual quality, faithful instruction following, improved reference and attribute preservation, and more controllable multi-identity edits. Our results highlight a practical path toward scalable unified visual generation, and the promise of interleaved, in-context computation as a foundation for general-purpose visual creation.",
    "published": "2026-01-05 18:56",
    "updated": "2026-01-05 18:56",
    "category": "RNA_design",
    "categories": [
      "cs.CV"
    ]
  },
  {
    "title": "Talk2Move: Reinforcement Learning for Text-Instructed Object-Level Geometric Transformation in Scenes",
    "authors": [
      "Jing Tan",
      "Zhaoyang Zhang",
      "Yantao Shen",
      "Jiarui Cai",
      "Shuo Yang",
      "Jiajun Wu",
      "Wei Xia",
      "Zhuowen Tu",
      "Stefano Soatto"
    ],
    "arxiv_id": "2601.02356v1",
    "url": "http://arxiv.org/abs/2601.02356v1",
    "summary": "We introduce Talk2Move, a reinforcement learning (RL) based diffusion framework for text-instructed spatial transformation of objects within scenes. Spatially manipulating objects in a scene through natural language poses a challenge for multimodal generation systems. While existing text-based manipulation methods can adjust appearance or style, they struggle to perform object-level geometric transformations-such as translating, rotating, or resizing objects-due to scarce paired supervision and pixel-level optimization limits. Talk2Move employs Group Relative Policy Optimization (GRPO) to explore geometric actions through diverse rollouts generated from input images and lightweight textual variations, removing the need for costly paired data. A spatial reward guided model aligns geometric transformations with linguistic description, while off-policy step evaluation and active step sampling improve learning efficiency by focusing on informative transformation stages. Furthermore, we design object-centric spatial rewards that evaluate displacement, rotation, and scaling behaviors directly, enabling interpretable and coherent transformations. Experiments on curated benchmarks demonstrate that Talk2Move achieves precise, consistent, and semantically faithful object transformations, outperforming existing text-guided editing approaches in both spatial accuracy and scene coherence.",
    "published": "2026-01-05 18:55",
    "updated": "2026-01-05 18:55",
    "category": "RNA_design",
    "categories": [
      "cs.CV"
    ]
  },
  {
    "title": "Falcon-H1R: Pushing the Reasoning Frontiers with a Hybrid Model for Efficient Test-Time Scaling",
    "authors": [
      "Falcon LLM Team",
      "Iheb Chaabane",
      "Puneesh Khanna",
      "Suhail Mohmad",
      "Slim Frikha",
      "Shi Hu",
      "Abdalgader Abubaker",
      "Reda Alami",
      "Mikhail Lubinets",
      "Mohamed El Amine Seddik",
      "Hakim Hacid"
    ],
    "arxiv_id": "2601.02346v1",
    "url": "http://arxiv.org/abs/2601.02346v1",
    "summary": "This work introduces Falcon-H1R, a 7B-parameter reasoning-optimized model that establishes the feasibility of achieving competitive reasoning performance with small language models (SLMs). Falcon-H1R stands out for its parameter efficiency, consistently matching or outperforming SOTA reasoning models that are $2\\times$ to $7\\times$ larger across a variety of reasoning-intensive benchmarks. These results underscore the importance of careful data curation and targeted training strategies (via both efficient SFT and RL scaling) in delivering significant performance gains without increasing model size. Furthermore, Falcon-H1R advances the 3D limits of reasoning efficiency by combining faster inference (through its hybrid-parallel architecture design), token efficiency, and higher accuracy. This unique blend makes Falcon-H1R-7B a practical backbone for scaling advanced reasoning systems, particularly in scenarios requiring extensive chain-of-thoughts generation and parallel test-time scaling. Leveraging the recently introduced DeepConf approach, Falcon-H1R achieves state-of-the-art test-time scaling efficiency, offering substantial improvements in both accuracy and computational cost. As a result, Falcon-H1R demonstrates that compact models, through targeted model training and architectural choices, can deliver robust and scalable reasoning performance.",
    "published": "2026-01-05 18:44",
    "updated": "2026-01-05 18:44",
    "category": "RNA_design",
    "categories": [
      "cs.AI"
    ]
  },
  {
    "title": "Question Answering for Multi-Release Systems: A Case Study at Ciena",
    "authors": [
      "Parham Khamsepour",
      "Mark Cole",
      "Ish Ashraf",
      "Sandeep Puri",
      "Mehrdad Sabetzadeh",
      "Shiva Nejati"
    ],
    "arxiv_id": "2601.02345v1",
    "url": "http://arxiv.org/abs/2601.02345v1",
    "summary": "Companies regularly have to contend with multi-release systems, where several versions of the same software are in operation simultaneously. Question answering over documents from multi-release systems poses challenges because different releases have distinct yet overlapping documentation. Motivated by the observed inaccuracy of state-of-the-art question-answering techniques on multi-release system documents, we propose QAMR, a chatbot designed to answer questions across multi-release system documentation. QAMR enhances traditional retrieval-augmented generation (RAG) to ensure accuracy in the face of highly similar yet distinct documentation for different releases. It achieves this through a novel combination of pre-processing, query rewriting, and context selection. In addition, QAMR employs a dual-chunking strategy to enable separately tuned chunk sizes for retrieval and answer generation, improving overall question-answering accuracy. We evaluate QAMR using a public software-engineering benchmark as well as a collection of real-world, multi-release system documents from our industry partner, Ciena. Our evaluation yields five main findings: (1) QAMR outperforms a baseline RAG-based chatbot, achieving an average answer correctness of 88.5% and an average retrieval accuracy of 90%, which correspond to improvements of 16.5% and 12%, respectively. (2) An ablation study shows that QAMR's mechanisms for handling multi-release documents directly improve answer accuracy. (3) Compared to its component-ablated variants, QAMR achieves a 19.6% average gain in answer correctness and a 14.0% average gain in retrieval accuracy over the best ablation. (4) QAMR reduces response time by 8% on average relative to the baseline. (5) The automatically computed accuracy metrics used in our evaluation strongly correlate with expert human assessments, validating the reliability of our methodology.",
    "published": "2026-01-05 18:44",
    "updated": "2026-01-05 18:44",
    "category": "RNA_design",
    "categories": [
      "cs.SE"
    ]
  },
  {
    "title": "Transverse Photoresistivity from Photothermal Current Deflection in Metal Films",
    "authors": [
      "Piyush Sakrikar",
      "Vincent M. Plisson",
      "Cameron Grant",
      "Dylan Rosenmerkel",
      "Gabriel Natale",
      "Michael Geiwitz",
      "Ying Ran",
      "Krzysztof Kempa",
      "Kenneth S. Burch"
    ],
    "arxiv_id": "2601.02340v1",
    "url": "http://arxiv.org/abs/2601.02340v1",
    "summary": "Quantum geometry in centrosymmetric systems has motivated the search for photocurrent responses beyond second order. In particular, electric field-induced nonlinear responses may also enable intrinsic polarization-sensitive optical detectors. Despite numerous efforts, clear methods are still needed to remove experimental artifacts, separating intrinsic from extrinsic effects, and disentangling linear responses from their higher-order counterparts. Here, we provide a systematic study of fabrication and measurement techniques to remove external artifacts in photoelectronic responses. This reveals a previously hidden photothermoelectric response in the transverse photoresistivity of symmetric thin films of simple metals. We identify its origin in thermal gradients producing current deflection and determine the device design and measurement parameters to minimize extrinsic effects that arise in photoinduced electronic responses.",
    "published": "2026-01-05 18:34",
    "updated": "2026-01-05 18:34",
    "category": "RNA_design",
    "categories": [
      "cond-mat.mtrl-sci"
    ]
  },
  {
    "title": "BEDS: Bayesian Emergent Dissipative Structures",
    "authors": [
      "Laurent Caraffa"
    ],
    "arxiv_id": "2601.02329v1",
    "url": "http://arxiv.org/abs/2601.02329v1",
    "summary": "We present BEDS (Bayesian Emergent Dissipative Structures), a theoretical framework that unifies concepts from non-equilibrium thermodynamics, Bayesian inference, information geometry, and machine learning. The central thesis proposes that learning, across physical, biological, and computational systems, fundamentally constitutes the conversion of flux into structure through entropy export. Building on Prigogine's theory of dissipative structures, we establish a formal isomorphism between thermodynamic processes and Bayesian updating, demonstrating that sustainable learning systems must follow dissipative patterns where crystallized posteriors become priors for subsequent levels of emergence.   We derive fundamental mathematical constants (e, π, φ) as fixed points of Bayesian inference under minimal axioms, suggesting these constants emerge necessarily from any system capable of representing and updating uncertainty. Furthermore, we propose a conjecture linking Gödel's incompleteness theorems to thermodynamic constraints, hypothesizing that pathologies of formal systems (incompleteness, undecidability) are structurally analogous to dissipation deficits in physical systems.   As practical validation, we present a peer-to-peer network architecture implementing BEDS principles, achieving six orders of magnitude improvement in energy efficiency compared to existing distributed consensus systems while enabling continuous learning. This work bridges fundamental physics, mathematical logic, and practical system design, offering both theoretical insights into the nature of learning and computation, and a concrete pathway toward sustainable artificial intelligence.",
    "published": "2026-01-05 18:21",
    "updated": "2026-01-05 18:21",
    "category": "RNA_design",
    "categories": [
      "cs.CV"
    ]
  },
  {
    "title": "Microscopy system for in situ sea ice structure and biology observations",
    "authors": [
      "Lessard-Hamel Béatrice",
      "Babin Marcel",
      "Thibault Simon"
    ],
    "arxiv_id": "2601.02328v1",
    "url": "http://arxiv.org/abs/2601.02328v1",
    "summary": "Sea ice harbours a rich community of well-adapted microorganisms that inhabit liquid micro-spaces where extreme conditions prevail. Currently at risk under climate change, the sea-ice microbiome holds mysteries about evolution of life on Earth and possibly elsewhere, which require methodological innovation to be unravelled. Gaining microscopic insight into the internal structure and biology of sea ice has traditionally been limited to destructive and extrusive ice core sampling methods. Here we present an in situ microscopic imaging system to observe undisturbed living microorganisms directly within sea the ice matrix. The complex and heterogeneous nature of sea ice, including its water crystal lattice, brine channels, air bubbles, and various impurities, presents engineering challenges for the development of this imaging system. Despite the fragile nature of the sea-ice matrix, we could successfully deploy, test and use the new in situ microscope during a recent expedition on the icepack in Arctic. We collected numerous images of live and intact single-celled and colony-forming diatoms, and documented for the first time at such a high resolution some microphysical features of sea ice. The hardware and software design of the endoscope is presented along with acquisition results of the microstructure and diatom images. These findings collectively demonstrate the potential for this new in situ microscopic imaging system to transform the way we study sea ice and to allow a deeper understanding of its complex microstructure and living microorganisms.",
    "published": "2026-01-05 18:20",
    "updated": "2026-01-05 18:20",
    "category": "RNA_design",
    "categories": [
      "physics.ao-ph",
      "physics.optics"
    ]
  },
  {
    "title": "A translation of \"What is differential geometry: curves and surfaces\"",
    "authors": [
      "Anton Petrunin",
      "Sergio Zamora Barrera"
    ],
    "arxiv_id": "2601.02325v1",
    "url": "http://arxiv.org/abs/2601.02325v1",
    "summary": "These notes are designed for those who either plan to work in differential geometry, or at least want to have a good reason not to do it. We discuss smooth curves and surfaces -- the main gate to differential geometry. We focus on the techniques that are absolutely essential for further study, keeping it problem-centered, elementary, visual, and virtually rigorous.",
    "published": "2026-01-05 18:16",
    "updated": "2026-01-05 18:16",
    "category": "RNA_design",
    "categories": [
      "math.HO",
      "math.DG"
    ]
  },
  {
    "title": "Cold-Starting Podcast Ads and Promotions with Multi-Task Learning on Spotify",
    "authors": [
      "Shivam Verma",
      "Hannes Karlbom",
      "Yu Zhao",
      "Nick Topping",
      "Vivian Chen",
      "Kieran Stanley",
      "Bharath Rengarajan"
    ],
    "arxiv_id": "2601.02306v1",
    "url": "http://arxiv.org/abs/2601.02306v1",
    "summary": "We present a unified multi-objective model for targeting both advertisements and promotions within the Spotify podcast ecosystem. Our approach addresses key challenges in personalization and cold-start initialization, particularly for new advertising objectives. By leveraging transfer learning from large-scale ad and content interactions within a multi-task learning (MTL) framework, a single joint model can be fine-tuned or directly applied to new or low-data targeting tasks, including in-app promotions. This multi-objective design jointly optimizes podcast outcomes such as streams, clicks, and follows for both ads and promotions using a shared representation over user, content, context, and creative features, effectively supporting diverse business goals while improving user experience. Online A/B tests show up to a 22% reduction in effective Cost-Per-Stream (eCPS), particularly for less-streamed podcasts, and an 18-24% increase in podcast stream rates. Offline experiments and ablations highlight the contribution of ancillary objectives and feature groups to cold-start performance. Our experience shows that a unified modeling strategy improves maintainability, cold-start performance, and coverage, while breaking down historically siloed targeting pipelines. We discuss practical trade-offs of such joint models in a real-world advertising system.",
    "published": "2026-01-05 17:48",
    "updated": "2026-01-05 17:48",
    "category": "RNA_design",
    "categories": [
      "cs.IR"
    ]
  },
  {
    "title": "Generative Site-Specific Beamforming for Next-Generation Spatial Intelligence",
    "authors": [
      "Zhaolin Wang",
      "Zihao Zhou",
      "Cheng-Jie Zhao",
      "Yuanwei Liu"
    ],
    "arxiv_id": "2601.02301v1",
    "url": "http://arxiv.org/abs/2601.02301v1",
    "summary": "This article proposes generative site-specific beamforming (GenSSBF) for next-generation spatial intelligence in wireless networks. Site-specific beamforming (SSBF) has emerged as a promising paradigm to mitigate the channel acquisition bottleneck in multiantenna systems by exploiting environmental priors. However, classical SSBF based on discriminative deep learning struggles: 1) to properly represent the inherent multimodality of wireless propagation and 2) to effectively capture the structural features of beamformers. In contrast, by leveraging conditional generative models, GenSSBF addresses these issues via learning a conditional distribution over feasible beamformers. By doing so, the synthesis of diverse and high-fidelity beam candidates from coarse channel sensing measurements can be guaranteed. This article presents the fundamentals, system designs, and implementation methods of GenSSBF. Case studies in both indoor and outdoor scenarios show that GenSSBF attains near-optimal beamforming gain with ultra-low channel acquisition overhead. Finally, several open research problems are highlighted.",
    "published": "2026-01-05 17:35",
    "updated": "2026-01-05 17:35",
    "category": "RNA_design",
    "categories": [
      "cs.IT"
    ]
  }
]